import React from "react";
import videohighlight from "../../../public/assets/videobackground.mp4";

const AboutFooter = () => {
  return (
    <div className="w-full h-[700px] flex items-center justify-between sm:flex-col-reverse sm:pt-[25px] ">
      <div className="w-full h-[450px] flex justify-center basis-[45%] p-[50px] sm:p-[20px] sm:basis-[20%]">
        <video src={videohighlight} muted controls></video>
      </div>
      <div className="noto-serif-khmer pr-[100px] flex  flex-col gap-[30px] text-justify w-[55%] sm:w-[100%] sm:px-[25px] ">
        <h1 className="text-[35px] underline sm:text-[20px] sm:text-center">
          អំពីបរិវេណសាលារៀន
        </h1>
        <p className="sm:text-[12px]">
          សាលារៀនជំនាន់ថ្មីនៃវិទ្យាល័យព្រះស៊ីសុវត្ថិ(NGS)គឺជាគំរូសាលារៀនមួយស្ថិតនៅក្នុងវិទ្យាល័យ​​ធំជាងគេនិងមានវ័យចំណាស់ជាងគេនៅក្នុងប្រទេសកម្ពុជាមានអាយុកាលជាង១១៣ឆ្នាំ។សាលារៀននេះជាលទ្ធផល
          មួយទៀតនៃការធ្វើកំណែទម្រង់ស៊ីជម្រៅលើវិស័យអប់រំ
          ដែលបានសម្ភោធដាក់ឱ្យដំណើរការ​នៅទី២៣ ខែ មិថុនា ឆ្នាំ ២០១៦
          មាន២៤ថ្នាក់រៀនចែកជាបន្ទប់រៀនគីមីវិទ្យាបំពាក់ដោយ​សម្ភារៈ បរិក្ខារពិសោធ
          ចំនួន០៣បន្ទប់
          បន្ទប់រៀនរូបវិទ្យាបំពាក់ដោយសម្ភារៈបរិក្ខារពិសោធចំនួន០៣បន្ទប់បន្ទប់រៀន​​​​​ជី​វវិទ្យាបំពាក់ដោយសម្ភារៈបរិក្ខាពិសោធចំនួន០៣បន្ទប់បន្ទប់រៀនកុំព្យូទ័របំពាក់ដោយ​ម៉ាស៊ីនកុំព្យូទ័រ​​ទំនើប
          ចំនួន០២បន្ទប់ស្មើ៦០គ្រឿងបន្ទប់គណិតវិទ្យា ០៤
          បន្ទប់រៀន​ពោពេញ​ដោយសម្ភារឧប្បទេស ចាប់ពីថ្នាក់ទី ៧ ដល់ថ្នាក់ទី​១២ ​
          គ្រូបង្រៀន សរុបចំនួន ៥៨នាក់ក្នុងនោះស្រី ៣០នាក់។ នៅក្នុងឆ្នាំសិក្សា
          ២០១៧-២០១៨ សាលារៀនជំនាន់ថ្មី នៃវិទ្យាល័យព្រះស៊ីសុវត្ថិ​ មានសិស្ស
          សរុបចំនួន៧៦៣នាក់ ក្នុងនោះស្រី៣៣៩នាក់។ សាលារៀនជំនាន់ថ្មី
          នៃវិទ្យាល័យព្រះស៊ីសុវត្ថិ បានអនុវត្តន៏គោលវិធីសិក្សាថ្មីពេញលេញ
          ដំបូងគេនៅសាលារដ្ឋគឺSTEM-Edដែលទាក់ទាញសិស្សពូកែៗ​ចូលរៀននិងប្រែក្លាយសិស្សដែលមិនចូលចិត្តរៀនវិទ្យាសាស្ត្រឱ្យចាប់អារម្មណ៏និងរៀនពូកែដែរ។ក្រៅពី​ការរៀន​ក្នុងថ្នាក់សិស្សមានការស្រាវជ្រាវជាច្រើន
          ដែលមានឧត្តមភាពនិងការប្រកួតប្រជែងនិងសហការ​ជាមួយគ្រឹះស្ថានជាតិនិងអន្តរជាតិ។បច្ចុប្បន្នសាលារៀនជំនាន់ថ្មីនៃវិទ្យាល័យព្រះស៊ីសុវត្ថិកំពុងធ្វើការអភិវឌ្ឍន៍របស់ខ្លួនក្រោមកិច្ចសហប្រត្តិបត្តិការជាមួយដៃ
          គូរជាតិនិងអន្តរជាតិមួយចំនួននៅប្រទេសថៃកូរ៉េចិនជប៉ុនសហរដ្ឋអាមេរិចអូស្រ្តាលី...។
        </p>
      </div>
    </div>
  );
};

export default AboutFooter;
